CSI API ETABS v1
cPropArea.GetDeckUnfilled Method
 Retrieves property data for an unfilled deck section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDeckUnfilled(
	string Name,
	ref double RibDepth,
	ref double RibWidthTop,
	ref double RibWidthBot,
	ref double RibSpacing,
	ref double ShearThickness,
	ref double UnitWeight
)
Function GetDeckUnfilled (
	Name As String,
	ByRef RibDepth As Double,
	ByRef RibWidthTop As Double,
	ByRef RibWidthBot As Double,
	ByRef RibSpacing As Double,
	ByRef ShearThickness As Double,
	ByRef UnitWeight As Double
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim RibDepth As Double
Dim RibWidthTop As Double
Dim RibWidthBot As Double
Dim RibSpacing As Double
Dim ShearThickness As Double
Dim UnitWeight As Double
Dim returnValue As Integer
returnValue = instance.GetDeckUnfilled(Name,
	RibDepth, RibWidthTop, RibWidthBot,
	RibSpacing, ShearThickness, UnitWeight)
int GetDeckUnfilled(
	String^ Name,
	double% RibDepth,
	double% RibWidthTop,
	double% RibWidthBot,
	double% RibSpacing,
	double% ShearThickness,
	double% UnitWeight
)
abstract GetDeckUnfilled :
        Name : string *
        RibDepth : float byref *
        RibWidthTop : float byref *
        RibWidthBot : float byref *
        RibSpacing : float byref *
        ShearThickness : float byref *
        UnitWeight : float byref -> int
Parameters
Name
Type: System.String
 The name of an existing unfilled deck property.
RibDepth
Type: System.Double
 Rib Depth, hr
RibWidthTop
Type: System.Double
 Rib Width Top, wrt
RibWidthBot
Type: System.Double
 Rib Width Bottom, wrb
RibSpacing
Type: System.Double
 Rib Spacing, sr
ShearThickness
Type: System.Double
 Deck Shear Thickness
UnitWeight
Type: System.Double
 Deck Unit Weight
Return Value
Type: Int32
 The function returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DeckType As eDeckType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
       Dim SlabDepth As Double
       Dim RibDepth As Double
       Dim RibWidthTop As Double
       Dim RibWidthBot As Double
       Dim RibSpacing As Double
       Dim ShearThickness As Double
       Dim UnitWeight As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetDeck("MyShellProp1A", eDeckType.Unfilled, eShellType.ShellThin, "4000Psi", 14)
   'set new area property
       ret = SapModel.PropArea.SetDeckUnfilled(Name:="MyShellProp1A", RibDepth:=1.1, RibWidthTop:=2.3, RibWidthBot:=2.4, RibSpacing:=7, ShearThickness:=5, UnitWeight:=3.1)
   'get area property data
       ret = SapModel.PropArea.GetDeck("MyShellProp1A", DeckType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'get area property data
       ret = SapModel.PropArea.GetDeckUnfilled("MyShellProp1A", RibDepth, RibWidthTop, RibWidthBot, RibSpacing, ShearThickness, UnitWeight)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace